package com.thomas.jxc.service;

import com.thomas.jxc.entity.UserRole;

/**
 * @创建人 thomas_liu
 * @创建时间 2018/9/10 18:39
 * @描述 TODO
 */
public interface UserRoleService {

    // ===========================================================
    // Constants
    // ===========================================================


    // ===========================================================
    // Fields
    // ===========================================================

    // ===========================================================
    // Constructors
    // ===========================================================


    // ===========================================================
    // Getter &amp; Setter
    // ===========================================================

    // ===========================================================
    // Methods for/from SuperClass/Interfaces
    // ===========================================================


    // ===========================================================
    // Methods
    // ===========================================================
    /**
     * 根据用户id删除所有关联信息
     * @param userId userId
     */
    void deleteByUserId(Integer userId);

    /**
     * 保存用户角色信息
     * @param userRole userRole
     */
    void save(UserRole userRole);


    /**
     *根据角色id删除所有关联信息
     * @param roleId roleId
     */
    @SuppressWarnings("unused")
    void deleteByRoleId(Integer roleId);
    // ===========================================================
    // Inner and Anonymous Classes
    // ===========================================================


}